mainster/sw4stm32_workbench/20-STM32F4_PRJ_GALVO_v2/src/adc_dac_dma.c
/**
 * @file        adc_dac_dma.c
 *
 * @date        30 Jan 2017
 * @author      Manuel Del Basso (mainster)
 * @email       manuel.delbasso@gmail.com
 *
 * @ide         System Workbench ac6 (eclipse stm32)
 * @stdperiph   STM32F4xx Standard peripheral drivers version 1.4.0 or greater required
 * @license		GNU GPL v3
 *
   @verbatim

	Copyright (C) 2016	Manuel Del Basso

	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	You should have received a copy of the GNU General Public License
	along with this program.  If not, see <http://www.gnu.org/licenses/>.

	@endverbatim
 *
 */

#include "adc_dac_dma.h"

/**
 * @addtogroup MD_APP
 * @{
 */

/**
 * @addtogroup _Macros
 * @{
 */

/**
 * @addtogroup _Typedefs
 * @{
 */

/**
 * @addtogroup _Variables
 * @{
 */

/**
 * @addtogroup _Functions
 * @{
 */


/** @} */

/** @} */

/** @} */

/** @} */

/** @} */


//autoSaveSystem_t ASG;
extern autoSaveSystem_t ASG;

/**
 * Ob multimode fuer X und Y Position sinnvoll ist, muss getestet werden.
 * Multimode bedeutet, dass 2 oder sogar 3 Wandlungen synchron ablaufen. 
 * Wenn ein "start Conversion" trigger an ADC1 gesendet wird, starten ADC2
 * und ggf ADC3 ebenfalls eine Wandlung.
 * Der DMA controller kann so konfiguriert werden, dass bei einem DMA-request 
 * einer der 2(3) ADC-Werte ins SRAM geschrieben wird 
 * Oder dass bei einem DMA-request zwei ADC Werte (dual half-word) gleichzeitig
 * ins SRAM uebertragen werden. 
 *      => Sinnvoll zb. bei einem Zustandsregler, dort werden position und 
 *         und Wicklungsstrom vom gleichen Zeitpunkt benoetigt.  
 */

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

/**
 * @brief      Definition of DAC Write Access pointer.
 *
 *             Use this function pointer to provide unprivileged, secure write
 *             access to the DAC hardware. When the ASG enters the system into
 *             fault state, the pointer reference changes to the ASG-tripped
 *             function" DAC_SetDualChanSigned_Tripped from which all actuator
 *             control signals are forced to output a predefined, safe value.
 */
DAC_WP_t (*DAC_SecureSetDualChanSigned) (int16_t, int16_t);




/**
 * @brief      Dual DAC set channel wrapper function.
 *
 *             This function extends the DAC_SetDualChannelData function which
 *             is a part of CMSIS driver layer. The extension provides active
 *             range checks for @b FIXME: min max values\b provided by a serial
 *             command to protect connected Galvos against algorithm failures
 *             which can raise in overcurrent states.
 *
 * @attention  ============================================================================
 *             DO NOT ACCESS THIS FUNCTION BY DIRECT FUNCTION CALL !!! WRITE
 *             ACCESS TO DAC REGISTERS SHOULD BE HANDLED BY FUNCTION POINTER
 *             DAC_SecureSetDualChanSigned()
 *             ============================================================================
 *
 * @param[in]  Data2   Raw DAC compensator algorithm output value for channel 2.
 * @param[in]  Data1   Raw DAC compensator algorithm output value for channel 1.
 *
 * @return     "Fingerabdruck" zum bestimmen ob tripped oder nicht!
 */
DAC_WP_t DAC_SetDualChanSigned(int16_t Data2, int16_t Data1) {
  // ===========================================================================
  //        DO NOT ACCESS THIS FUNCTION BY DIRECT FUNCTION CALL !!!
  // ===========================================================================
  
  /* TODO:  Implement active range checks */  
  DAC_SetDualChannelData(DAC_Align_12b_R, Data2 + AN_BIAS_INT, Data1 + AN_BIAS_INT);
  return DEFAULT_WRITE_DAC;
}


/* ===========================================================================
 *  DAC_SetDualChanSigned_Tripped() defines the error condition function
 *  Point to this function if an ASS error conditon (i.e. Tripped) ocured 
 * =========================================================================== */
DAC_WP_t DAC_SetDualChanSigned_Tripped(int16_t dummy1, int16_t dummy2) {
  uint16_t data2, data1;

  data2 = decode_toUint(ASG.safeVal + VA_BIAS);
  data1 = decode_toUint(ASG.safeVal + VA_BIAS);

  DAC_SetDualChannelData( DAC_Align_12b_R, data2, data1);

  return TRIPPED_WRITE_DAC;
}

/**
 * Timer-triggered ADC-scan mode with DMA to memory
 * --------------------------------------------------
 *
 * remember:    - once initialized, first ADC conversion must be started
 *                by a ADC_SoftwareStartConv(ADC1) or whereever the first 
 *                channel of the regular group runs (ADC1 ,2 ,3)
 *
 *  - Timer controlled group scan restart is configured by
 *    *.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_TRGO; This means NOT that 
 *    start-events for ADC regular scan are generated by the Timer update ISR!!!
 *    Configure TIM for generating Output Trigger events!
 *    TIM_SelectOutputTrigger(TIM2,TIM_TRGOSource_Update);
 * 
 *    @param    memSize is an integer value, the DMA controller transfers memSize
 *              datagrams befor circulating. Also memSize ADC regular channels have
 *              to be configured within this init procedure (ADC_RegularChannelConfig)
 */          

/* ====================================================================================  
                    Enable AN, GPIO, TIM and DMA clocks
   ==================================================================================== */ 
void RCC_Configuration(void) {
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
}

/* ====================================================================================  
                    ADC common and regular scan group init
   ==================================================================================== */ 
void ADC_Configuration(void)
{
  ADC_CommonInitTypeDef ADC_CommonInitStructure;
  ADC_InitTypeDef ADC_InitStructure;
  
    /* ADC Common Init */
  ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;
  ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
  ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
  ADC_CommonInit(&ADC_CommonInitStructure);

