mainster/sw4stm32_workbench/20-STM32F4_PRJ_GALVO_v2/src/adc_dac_dma.c
  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_Rising;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_TRGO;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfConversion = 0x02; /* 5 channels in total */
  ADC_Init(ADC1, &ADC_InitStructure);

    /* ADC1 regular channel selection 
     * @NOTE Changes to this config affects the channel index for ADC_MultiConvBuff[ ]
     * in the PID algorithm function */
  ADC_RegularChannelConfig(ADC1, ADC_X_CHAN , 1, ADC_SampleTime_3Cycles);         
  ADC_RegularChannelConfig(ADC1, ADC_Y_CHAN , 2, ADC_SampleTime_3Cycles); 
//    ADC_RegularChannelConfig(ADC1, ADC_Ix_CHAN, 3, ADC_SampleTime_3Cycles); 
//    ADC_RegularChannelConfig(ADC1, ADC_W_CHAN , 4, ADC_SampleTime_3Cycles);

    /* Enable DMA request after last transfer (Single-ADC mode) */
  ADC_DMARequestAfterLastTransferCmd(ADC1, ENABLE);

    /* Enable ADC1 DMA */
  ADC_DMACmd(ADC1, ENABLE);

    /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);
}

/* ====================================================================================  
                    Configure ADC Analog watchdog 
   ==================================================================================== */
void AnalogWatchdog_Configuration (void) {
  ADC_AnalogWatchdogSingleChannelConfig(ADC1, ADC_Y_CHAN);
  ADC_AnalogWatchdogThresholdsConfig(ADC1, 0x7ff, 0);
  ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_SingleRegEnable);
//  ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_AllRegEnable);
}    

/* ====================================================================================  
                    DMA2 Stream0 channel0 configuration  
   ==================================================================================== */ 
void DMA_Configuration( __IO int16_t *MultiConvBuff, uint8_t memSize) {
  DMA_InitTypeDef DMA_InitStructure;

    /* Initialise DMA */
  DMA_StructInit(&DMA_InitStructure);

    /* config DMA Controller */
    DMA_InitStructure.DMA_Channel = DMA_Channel_0; /* See Tab 20 */
    DMA_InitStructure.DMA_BufferSize = memSize; /* 5 * memsize */
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory; /* direction */

    /* 
     *if 4 or more channels / conversions take place, enable FIFO 
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enabled; 
    DMA_InitStructure.DMA_FIFOThreshold = 1/4 oder so; 
     */
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable; /* no FIFO */
  DMA_InitStructure.DMA_FIFOThreshold = 0;
  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular; /* circular buffer */
    DMA_InitStructure.DMA_Priority = DMA_Priority_High; /* high priority */

    /* config target memory */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)MultiConvBuff; /* target addr */
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord; /* 16 bit */
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_Init(DMA2_Stream0, &DMA_InitStructure); /* See Table 20 for mapping */

    /* Enable DMA Stream Half / Transfer Complete interrupt */
  DMA_ITConfig(DMA2_Stream0, DMA_IT_TC | DMA_IT_HT, ENABLE);

  DMA_Cmd(DMA2_Stream0, ENABLE);
}



void TIM2_DMA_triggerConfiguration(FunctionalState TimerRun, \
  FunctionalState IntOn, uint16_t peri) {	
  TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
  
  /* Time base configuration */
  TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
  TIM_TimeBaseStructure.TIM_Period = peri; 
  TIM_TimeBaseStructure.TIM_Prescaler = 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
  
  /* TIM2 TRGO selection */
  TIM_SelectOutputTrigger(TIM2, TIM_TRGOSource_Update); // ADC_ExternalTrigConv_T2_TRGO
  TIM_ITConfig(TIM2, TIM_IT_Update, IntOn);	
  /* TIM2 enable counter */
  TIM_Cmd(TIM2, TimerRun);
}


/* ====================================================================================  
                    NVI controller configuration  
   ==================================================================================== */ 
void NVIC_Configuration(void) {
  NVIC_InitTypeDef  NVIC_InitStruct_DMA, \
  NVIC_InitStruct_ADC, \
  nvic_cfg;
  
    /* Enable the DMA Stream IRQ Channel */
  NVIC_InitStruct_DMA.NVIC_IRQChannel = DMA2_Stream0_IRQn;
  NVIC_InitStruct_DMA.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStruct_DMA.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStruct_DMA.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStruct_DMA);
  
    /* Enable the TIM2 IRQ Channel */
  nvic_cfg.NVIC_IRQChannel = TIM2_IRQn;
  nvic_cfg.NVIC_IRQChannelPreemptionPriority = 0;
  nvic_cfg.NVIC_IRQChannelSubPriority = 0;
  nvic_cfg.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&nvic_cfg);

    /* ADC Analog watchdog interrupt enable */
  NVIC_InitStruct_ADC.NVIC_IRQChannel = ADC_IRQn;
  NVIC_InitStruct_ADC.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStruct_ADC.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStruct_ADC.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStruct_ADC);
  ADC_ITConfig(ADC1, ADC_IT_AWD, ENABLE);

}


/*  ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ==================================================================================== */ 



#ifdef ADC_DMA_BIS_19_05_2015
void ADC_ContScanMode_w_DMA_timeTrigd ( __IO int16_t *MultiConvBuff, 
 uint8_t memSize) {

/* ====================================================================================  
                    Define init structures
   ==================================================================================== */ 
  ADC_InitTypeDef         ADC_InitStructure;
  ADC_CommonInitTypeDef   ADC_CommonInitStructure;
  DMA_InitTypeDef         DMA_InitStructure;
  GPIO_InitTypeDef        GPIO_InitStructure;
  NVIC_InitTypeDef        NVIC_InitStructure;

