mainster/sw4stm32_workbench/20-STM32F4_PRJ_GALVO_v2/src/adc_dac_dma.c
}

#endif




#ifdef ADC_DMA_DUALMODECONFIG
void ADC_DMA_DualModeConfig(__IO int16_t *MultiConvBuff) {
  ADC_CommonInitTypeDef ADC_CommonInitStructure;

/* ====================================================================================  
                    Enable peripheral clocks  
   ==================================================================================== */ 
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2, ENABLE);

/* ====================================================================================  
                    DMA2 Stream0 channel0 configuration  
   ==================================================================================== */ 
  DMA_InitTypeDef DMA_InitStructure;

/*  The transfer stops once the DMA_SxNDTR register reaches zero, when the peripheral 
 *  requests the end of transfers (in case of a peripheral flow controller) or when the
 *   EN bit in the DMA_SxCR register is cleared by software.    S306
 */
  DMA_InitStructure.DMA_Channel = DMA_Channel_0; 
  DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) MultiConvBuff;
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) ADC_CCR_ADDRESS;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;


  DMA_InitStructure.DMA_BufferSize = 2;


  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;// DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;         
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_Init(DMA2_Stream0, &DMA_InitStructure);

/* ====================================================================================  
                    DMA transmission-complete interrupt config
   ==================================================================================== */
   // DMA_ITConfig(DMA2_Stream0, DMA_IT_TC, ENABLE);
    DMA_ITConfig(DMA2_Stream0, DMA_IT_TC, DISABLE);
    DMA_ClearITPendingBit(DMA2_Stream0, DMA_IT_TC);
    
    NVIC_InitTypeDef      NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = DMA2_Stream0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 6;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    /* DMA2_Stream0 enable */
    DMA_Cmd(DMA2_Stream0, DISABLE);
    
    DMA_DeInit(DMA2_Stream0);
/* ====================================================================================  
                    ADC GPIO init
   ==================================================================================== */ 
    GPIO_InitTypeDef GPIO_InitStructure;
///<                                    W(t) |   pos_X(t) |   pos_y(t)      
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

/* ====================================================================================  
                    ADC common init
   ==================================================================================== */ 
    ADC_CommonInitStructure.ADC_Mode = ADC_DualMode_RegSimult;
    ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div8;
    ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
    ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
    ADC_CommonInit(&ADC_CommonInitStructure);

/* ====================================================================================  
                    ADC regular channel config
   ==================================================================================== */ 
    ADC_InitTypeDef ADC_InitStructure;

    ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
//    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_CC2;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_TRGO;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfConversion = 1;
    ADC_Init(ADC1, &ADC_InitStructure);
    /* ADC1 regular channel_06 (pos_X)  */ 
    ADC_RegularChannelConfig(ADC1, ADC_W_CHAN, 1, ADC_SampleTime_15Cycles);

    ADC_Init(ADC2, &ADC_InitStructure);
    /* ADC2 regular channels 03 (setpoint), 07 (pos_Y)  */ 
    ADC_RegularChannelConfig(ADC2, ADC_Y_CHAN, 1, ADC_SampleTime_15Cycles);
//    ADC_RegularChannelConfig(ADC2, ADC_W_CHAN, 3, ADC_SampleTime_3Cycles);

/* ====================================================================================  
                    ADC end-of-conversion interrupt config
   ==================================================================================== */
    /* Enable ADC2 end of conversion interrupt */
    ADC_ITConfig(ADC2, ADC_IT_EOC, ENABLE);
    
    /* configure vectored interrupt controller */
    NVIC_InitStructure.NVIC_IRQChannel = ADC_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable DMA request after last transfer (Multi-ADC mode)  */
    ADC_MultiModeDMARequestAfterLastTransferCmd(DISABLE);
    ADC_Cmd(ADC1, ENABLE);      ///< Enable ADC1
    ADC_Cmd(ADC2, ENABLE);      ///< Enable ADC2

/* ====================================================================================  */

    ADC_SoftwareStartConv(ADC1);    ///< Start ADC1 Software Conversion
    
