mainster/sw4stm32_workbench/20-STM32F4_PRJ_GALVO_v2/src/adc_dac_dma.c
  }
//#pragma O2
#endif

#ifdef ADC_CONTSCANMODE_W_DMA  
  void ADC_ContScanMode_w_DMA (__IO int16_t *MultiConvBuff) {

    /* Define ADC init structures */
    ADC_InitTypeDef       ADC_InitStructure;
    ADC_CommonInitTypeDef ADC_CommonInitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    DMA_InitTypeDef DMA_InitStructure;

    /* Initialise DMA */
    DMA_StructInit(&DMA_InitStructure);

    /* Enable clock on DMA1 */
    /* Enable DMA2, thats where ADC is hooked on -> see Tab 20 (RM00090) */
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);               
    /* config of DMAC */
    DMA_InitStructure.DMA_Channel = DMA_Channel_0;                     
    DMA_InitStructure.DMA_BufferSize = 2;                       /* 2 * memsize */
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;     /* direction */
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;      /* no FIFO */
    DMA_InitStructure.DMA_FIFOThreshold = 0;
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;            /* circular buffer */
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;        /* high priority */
    /* config of memory */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)MultiConvBuff; /* target address */
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord; /* 16 bit */
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable; /* increment after wrt */
    /* config of peripheral */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_Init(DMA2_Stream0, &DMA_InitStructure); /* See Table 20 for mapping */
    DMA_Cmd(DMA2_Stream0, ENABLE);

    ADC_StructInit(&ADC_InitStructure);
    ADC_CommonStructInit(&ADC_CommonInitStructure);

    /* init ADC clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);

    /* init ADC */
    ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;
    ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
    ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
    ADC_CommonInit(&ADC_CommonInitStructure);

    ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ExternalTrigConvEdge = 0;
    ADC_InitStructure.ADC_ExternalTrigConv = 0;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfConversion = 2; /* 2 channels in total */
    ADC_Init(ADC1, &ADC_InitStructure);

    /* Enable Vref & Temperature channel */
    ADC_TempSensorVrefintCmd(ENABLE);

    /* Configure channels */
    /* Temp sensor */
    ADC_RegularChannelConfig(ADC1, ADC_Channel_16, 1, ADC_SampleTime_480Cycles);
    /* VREF_int (2nd) */
    ADC_RegularChannelConfig(ADC1, ADC_Channel_17, 2, ADC_SampleTime_480Cycles);

    /* Enable ADC interrupts */
    ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);

    /* Enable DMA request after last transfer (Single-ADC mode) */
    ADC_DMARequestAfterLastTransferCmd(ADC1, ENABLE);

    /* Enable ADC3 DMA */
    ADC_DMACmd(ADC1, ENABLE);
    /* Configure NVIC */
    NVIC_InitStructure.NVIC_IRQChannel = ADC_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable ADC1 **************************************************************/
    ADC_Cmd(ADC1, ENABLE);
    ADC_SoftwareStartConv(ADC1);
  }
#endif
/////////////////////////////////////////////////////////////////////////
//http://survivalengineer.blogspot.de/2013/03/stm32f4-and-most-of-what-you-ever.html
/////////////////////////////////////////////////////////////////////////

/**
  * @brief  Set the specified data holding register value for DAC channel.
  * @param  val: signed 16 bit integer truncated to 12bit range.
  *                 (-2048  ... 2047)   
  *                 (-0x800 ... 0x7ff)  Data to be loaded.
  * @retval None
  */
  void DAC_SetSignedValue(MD_DAC_Channel_t DACx, int16_t val) {
    const short OFFS = 2047;
    
    if(val > 2047)
      val = 2047;
    if(val < -2047)
      val = -2047;

    if (DACx == MD_DAC1) {
      DAC_SetChannel1Data(DAC_Align_12b_R, val + OFFS);
    } else {
      DAC_SetChannel2Data(DAC_Align_12b_R, val + OFFS);
    }
  }


